{
  "lastUpdated": "2025-10-15T00:42:11.099358",
  "keywords": [
    "RNAseq"
  ],
  "totalResults": 20,
  "papers": [
    {
      "title": "Trajectory Inference with Smooth Schrödinger Bridges",
      "authors": [
        "Wanli Hong",
        "Yuliang Shi",
        "Jonathan Niles-Weed"
      ],
      "summary": "Motivated by applications in trajectory inference and particle tracking, we\nintroduce Smooth Schr\\\"odinger Bridges. Our proposal generalizes prior work by\nallowing the reference process in the Schr\\\"odinger Bridge problem to be a\nsmooth Gaussian process, leading to more regular and interpretable trajectories\nin applications. Though na\\\"ively smoothing the reference process leads to a\ncomputationally intractable problem, we identify a class of processes\n(including the Mat\\'ern processes) for which the resulting Smooth Schr\\\"odinger\nBridge problem can be lifted to a simpler problem on phase space, which can be\nsolved in polynomial time. We develop a practical approximation of this\nalgorithm that outperforms existing methods on numerous simulated and real\nsingle-cell RNAseq datasets. The code can be found at\nhttps://github.com/WanliHongC/Smooth_SB",
      "link": "http://arxiv.org/abs/2503.00530v1",
      "published": "2025-03-01T15:12:01Z",
      "updated": "2025-03-01T15:12:01Z"
    },
    {
      "title": "Large Language Models Meet Graph Neural Networks for Text-Numeric Graph\n  Reasoning",
      "authors": [
        "Haoran Song",
        "Jiarui Feng",
        "Guangfu Li",
        "Michael Province",
        "Philip Payne",
        "Yixin Chen",
        "Fuhai Li"
      ],
      "summary": "In real-world scientific discovery, human beings always make use of the\naccumulated prior knowledge with imagination pick select one or a few most\npromising hypotheses from large and noisy data analysis results. In this study,\nwe introduce a new type of graph structure, the text-numeric graph (TNG), which\nis defined as graph entities and associations have both text-attributed\ninformation and numeric information. The TNG is an ideal data structure model\nfor novel scientific discovery via graph reasoning because it integrates\nhuman-understandable textual annotations or prior knowledge, with numeric\nvalues that represent the observed or activation levels of graph entities or\nassociations in different samples. Together both the textual information and\nnumeric values determine the importance of graph entities and associations in\ngraph reasoning for novel scientific knowledge discovery. We further propose\nintegrating large language models (LLMs) and graph neural networks (GNNs) to\nanalyze the TNGs for graph understanding and reasoning. To demonstrate the\nutility, we generated the text-omic(numeric) signaling graphs (TOSG), as one\ntype of TNGs, in which all graphs have the same entities, associations and\nannotations, but have sample-specific entity numeric (omic) values using single\ncell RNAseq (scRNAseq) datasets of different diseases. We proposed joint\nLLM-GNN models for key entity mining and signaling pathway mining on the TOSGs.\nThe evaluation results showed the LLM-GNN and TNGs models significantly improve\nclassification accuracy and network inference. In conclusion, the TNGs and\njoint LLM-GNN models are important approaches for scientific discovery.",
      "link": "http://arxiv.org/abs/2501.16361v1",
      "published": "2025-01-21T00:29:23Z",
      "updated": "2025-01-21T00:29:23Z"
    },
    {
      "title": "A mapping-free NLP-based technique for sequence search in Nanopore\n  long-reads",
      "authors": [
        "Tomasz Strzoda",
        "Lourdes Cruz-Garcia",
        "Mustafa Najim",
        "Christophe Badie",
        "Joanna Polanska"
      ],
      "summary": "In unforeseen situations, such as nuclear power plant's or civilian radiation\naccidents, there is a need for effective and computationally inexpensive\nmethods to determine the expression level of a selected gene panel, allowing\nfor rough dose estimates in thousands of donors. The new generation in-situ\nmapper, fast and of low energy consumption, working at the level of single\nnanopore output, is in demand. We aim to create a sequence identification tool\nthat utilizes Natural Language Processing (NLP) techniques and ensures a high\nlevel of negative predictive value (NPV) compared to the classical approach.\nThe training dataset consisted of RNASeq data from 6 samples. Having tested\nmultiple NLP models, the best configuration analyses the entire sequence and\nuses a word length of 3 base pairs with one-word neighbor on each side. For the\nconsidered FDXR gene, the achieved mean balanced accuracy (BACC) was 98.29% and\nNPV 99.25%, compared to minimap2's performance in a cross-validation scenario.\nReducing the dictionary from 1024 to 145 changed BACC to 96.49% and the NPV to\n98.15%. Obtained NLP model, validated on an external independent genome\nsequencing dataset, gave NPV of 99.64% for complete and 95.87% for reduced\ndictionary. The salmon-estimated read counts differed from the classical\napproach on average by 3.48% for the complete dictionary and by 5.82% for the\nreduced one. We conclude that for long Oxford Nanopore reads, an NLP-based\napproach can successfully replace classical mapping in case of emergency. The\ndeveloped NLP model can be easily retrained to identify selected transcripts\nand/or work with various long-read sequencing techniques. Our results of the\nstudy clearly demonstrate the potential of applying techniques known from\nclassical text processing to nucleotide sequences and represent a significant\nadvancement in this field of science.",
      "link": "http://arxiv.org/abs/2406.14187v1",
      "published": "2024-06-20T10:48:19Z",
      "updated": "2024-06-20T10:48:19Z"
    },
    {
      "title": "A Multi-Domain Multi-Task Approach for Feature Selection from Bulk RNA\n  Datasets",
      "authors": [
        "Karim Salta",
        "Tomojit Ghosh",
        "Michael Kirby"
      ],
      "summary": "In this paper a multi-domain multi-task algorithm for feature selection in\nbulk RNAseq data is proposed. Two datasets are investigated arising from mouse\nhost immune response to Salmonella infection. Data is collected from several\nstrains of collaborative cross mice. Samples from the spleen and liver serve as\nthe two domains. Several machine learning experiments are conducted and the\nsmall subset of discriminative across domains features have been extracted in\neach case. The algorithm proves viable and underlines the benefits of across\ndomain feature selection by extracting new subset of discriminative features\nwhich couldn't be extracted only by one-domain approach.",
      "link": "http://arxiv.org/abs/2405.02534v1",
      "published": "2024-05-04T01:36:05Z",
      "updated": "2024-05-04T01:36:05Z"
    },
    {
      "title": "Cell reprogramming design by transfer learning of functional\n  transcriptional networks",
      "authors": [
        "Thomas P. Wytock",
        "Adilson E. Motter"
      ],
      "summary": "Recent developments in synthetic biology, next-generation sequencing, and\nmachine learning provide an unprecedented opportunity to rationally design new\ndisease treatments based on measured responses to gene perturbations and drugs\nto reprogram cells. The main challenges to seizing this opportunity are the\nincomplete knowledge of the cellular network and the combinatorial explosion of\npossible interventions, both of which are insurmountable by experiments. To\naddress these challenges, we develop a transfer learning approach to control\ncell behavior that is pre-trained on transcriptomic data associated with human\ncell fates, thereby generating a model of the network dynamics that can be\ntransferred to specific reprogramming goals. The approach combines\ntranscriptional responses to gene perturbations to minimize the difference\nbetween a given pair of initial and target transcriptional states. We\ndemonstrate our approach's versatility by applying it to a microarray dataset\ncomprising >9,000 microarrays across 54 cell types and 227 unique\nperturbations, and an RNASeq dataset consisting of >10,000 sequencing runs\nacross 36 cell types and 138 perturbations. Our approach reproduces known\nreprogramming protocols with an AUROC of 0.91 while innovating over existing\nmethods by pre-training an adaptable model that can be tailored to specific\nreprogramming transitions. We show that the number of gene perturbations\nrequired to steer from one fate to another increases with decreasing\ndevelopmental relatedness and that fewer genes are needed to progress along\ndevelopmental paths than to regress. These findings establish a\nproof-of-concept for our approach to computationally design control strategies\nand provide insights into how gene regulatory networks govern phenotype.",
      "link": "http://arxiv.org/abs/2403.04837v1",
      "published": "2024-03-07T19:00:02Z",
      "updated": "2024-03-07T19:00:02Z"
    },
    {
      "title": "A Weibull Mixture Cure Frailty Model for High-dimensional Covariates",
      "authors": [
        "Fatih Kızılaslan",
        "David Michael Swanson",
        "Valeria Vitelli"
      ],
      "summary": "A novel mixture cure frailty model is introduced for handling censored\nsurvival data. Mixture cure models are preferable when the existence of a cured\nfraction among patients can be assumed. However, such models are heavily\nunderexplored: frailty structures within cure models remain largely\nundeveloped, and furthermore, most existing methods do not work for\nhigh-dimensional datasets, when the number of predictors is significantly\nlarger than the number of observations. In this study, we introduce a novel\nextension of the Weibull mixture cure model that incorporates a frailty\ncomponent, employed to model an underlying latent population heterogeneity with\nrespect to the outcome risk. Additionally, high-dimensional covariates are\nintegrated into both the cure rate and survival part of the model, providing a\ncomprehensive approach to employ the model in the context of high-dimensional\nomics data. We also perform variable selection via an adaptive elastic-net\npenalization, and propose a novel approach to inference using the\nexpectation-maximization (EM) algorithm. Extensive simulation studies are\nconducted across various scenarios to demonstrate the performance of the model,\nand results indicate that our proposed method outperforms competitor models. We\napply the novel approach to analyze RNAseq gene expression data from bulk\nbreast cancer patients included in The Cancer Genome Atlas (TCGA) database. A\nset of prognostic biomarkers is then derived from selected genes, and\nsubsequently validated via both functional enrichment analysis and comparison\nto the existing biological literature. Finally, a prognostic risk score index\nbased on the identified biomarkers is proposed and validated by exploring the\npatients' survival.",
      "link": "http://arxiv.org/abs/2401.06575v2",
      "published": "2024-01-12T13:49:55Z",
      "updated": "2024-04-26T09:18:45Z"
    },
    {
      "title": "Semi-Supervised Clustering via Structural Entropy with Different\n  Constraints",
      "authors": [
        "Guangjie Zeng",
        "Hao Peng",
        "Angsheng Li",
        "Zhiwei Liu",
        "Runze Yang",
        "Chunyang Liu",
        "Lifang He"
      ],
      "summary": "Semi-supervised clustering techniques have emerged as valuable tools for\nleveraging prior information in the form of constraints to improve the quality\nof clustering outcomes. Despite the proliferation of such methods, the ability\nto seamlessly integrate various types of constraints remains limited. While\nstructural entropy has proven to be a powerful clustering approach with\nwide-ranging applications, it has lacked a variant capable of accommodating\nthese constraints. In this work, we present Semi-supervised clustering via\nStructural Entropy (SSE), a novel method that can incorporate different types\nof constraints from diverse sources to perform both partitioning and\nhierarchical clustering. Specifically, we formulate a uniform view for the\ncommonly used pairwise and label constraints for both types of clustering.\nThen, we design objectives that incorporate these constraints into structural\nentropy and develop tailored algorithms for their optimization. We evaluate SSE\non nine clustering datasets and compare it with eleven semi-supervised\npartitioning and hierarchical clustering methods. Experimental results\ndemonstrate the superiority of SSE on clustering accuracy with different types\nof constraints. Additionally, the functionality of SSE for biological data\nanalysis is demonstrated by cell clustering experiments conducted on four\nsingle-cell RNAseq datasets.",
      "link": "http://arxiv.org/abs/2312.10917v1",
      "published": "2023-12-18T04:00:40Z",
      "updated": "2023-12-18T04:00:40Z"
    },
    {
      "title": "The Promise of Cross-Species Coexpression Analysis in Studying the\n  Coevolution and Ecology of Host-Symbiont Interactions",
      "authors": [
        "Amanda K Hund",
        "Peter Tiffin",
        "Jean-Gabriel Young",
        "Daniel I Bolnick"
      ],
      "summary": "Measuring gene expression simultaneously in both hosts and symbionts offers a\npowerful approach to explore the biology underlying species interactions. Such\ndual or simultaneous RNAseq approaches have primarily been used to gain insight\ninto gene function in model systems, but there is opportunity to expand and\napply these tools in new ways to understand ecological and evolutionary\nquestions. By incorporating genetic diversity in both hosts and symbionts and\nstudying how gene expression is correlated between partner species, we can gain\nnew insight into host-symbiont coevolution and the ecology of species\ninteractions. In this perspective, we explore how these relatively new tools\ncould be applied to study such questions. We review the mechanisms that could\nbe generating patterns of cross-species gene coexpression, including indirect\ngenetic effects and selective filters, how these tools could be applied across\ndifferent biological and temporal scales, and outline other methodological\nconsiderations and experiment possibilities.",
      "link": "http://arxiv.org/abs/2206.12711v1",
      "published": "2022-06-25T18:52:18Z",
      "updated": "2022-06-25T18:52:18Z"
    },
    {
      "title": "Online FDR Control for RNAseq Data",
      "authors": [
        "Lathan Liou",
        "Milena Hornburg",
        "David S. Robertson"
      ],
      "summary": "Motivation: While the analysis of a single RNA sequencing (RNAseq) dataset\nhas been well described in the literature, modern research workflows often have\nadditional complexity in that related RNAseq experiments are performed\nsequentially over time. The simplest and most widely used analysis strategy\nignores the temporal aspects and analyses each dataset separately. However,\nthis can lead to substantial inflation of the overall false discovery rate\n(FDR). We propose applying recently developed methodology for online hypothesis\ntesting to analyse sequential RNAseq experiments in a principled way,\nguaranteeing FDR control at all times while never changing past decisions.\nResults: We show that standard offline approaches have variable control of FDR\nof related RNAseq experiments over time and a naively composed approach may\nimproperly change historic decisions. We demonstrate that the online FDR\nalgorithms are a principled way to guarantee control of FDR. Furthermore, in\ncertain simulation scenarios, we observe empirically that online approaches\nhave comparable power to offline approaches. Availability and Implementation:\nThe onlineFDR package is freely available at http:\n//www.bioconductor.org/packages/onlineFDR. Additional code used for the\nsimulation studies can be found at\nhttps://github.com/latlio/onlinefdr_rnaseq_simulation",
      "link": "http://arxiv.org/abs/2206.02213v1",
      "published": "2022-06-05T16:34:49Z",
      "updated": "2022-06-05T16:34:49Z"
    },
    {
      "title": "Network analyses reveal negative link between changes in adipose tissue\n  GDF15 and BMI during dietary-induced weight loss",
      "authors": [
        "Alyssa Imbert",
        "Nathalie Vialaneix",
        "Julien Marquis",
        "Julie Vion",
        "Aline Charpagne",
        "Sylviane Metairon",
        "Claire Laurens",
        "Cedric Moro",
        "Nathalie Boulet",
        "Ondine Walter",
        "Grégory Lefebvre",
        "Jörg Hager",
        "Dominique Langin",
        "Wim Saris",
        "Arne Astrup",
        "Nathalie Viguerie",
        "Armand Valsesia"
      ],
      "summary": "Adipose tissue (AT) transcriptome studies provide holistic pictures of\nadaptation to weight and related bioclinical settings changes. Objective To\nimplement AT gene expression profiling and investigate the link between changes\nin bioclinical parameters and AT gene expression during 3 steps of a 2-phase\ndietary intervention (DI). Methods AT transcriptome profiling was obtained from\nsequencing 1051 samples, corresponding to 556 distinct individuals enrolled in\na weight loss intervention (8-week low-calorie diet (LCD) at 800 kcal/day)\nfollowed with a 6-month ad libitum randomized DI. Transcriptome profiles\nobtained with QuantSeq sequencing were benchmarked against Illumina RNAseq.\nReverse transcription quantitative polymerase chain reaction was used to\nfurther confirm associations. Cell specificity was assessed using freshly\nisolated cells and THP-1 cell line. Results During LCD, 5 modules were found,\nof which 3 included at least 1 bioclinical variable. Change in body mass index\n(BMI) connected with changes in mRNA level of genes with inflammatory response\nsignature. In this module, change in BMI was negatively associated with changes\nin expression of genes encoding secreted protein (GDF15, CCL3, and SPP1).\nThrough all phases of the DI, change in GDF15 was connected to changes in SPP1,\nCCL3, LIPA and CD68. Further characterization showed that these genes were\nspecific to macrophages (with LIPA, CD68 and GDF15 expressed in\nanti-inflammatory macrophages) and GDF15 also expressed in preadipocytes.\nConclusion Network analyses identified a novel AT feature with GDF15\nupregulated with calorie restriction induced weight loss, concomitantly to\nmacrophage markers. In AT, GDF15 was expressed in preadipocytes and macrophages\nwhere it was a hallmark of anti-inflammatory cells.",
      "link": "http://arxiv.org/abs/2203.09356v1",
      "published": "2022-03-17T14:40:25Z",
      "updated": "2022-03-17T14:40:25Z"
    },
    {
      "title": "Geometric structure guided model and algorithms for complete\n  deconvolution of gene expression data",
      "authors": [
        "Duan Chen",
        "Shaoyu Li",
        "Xue Wang"
      ],
      "summary": "Complete deconvolution analysis for bulk RNAseq data is important and helpful\nto distinguish whether the difference of disease-associated GEPs (gene\nexpression profiles) in tissues of patients and normal controls are due to\nchanges in cellular composition of tissue samples, or due to GEPs changes in\nspecific cells. One of the major techniques to perform complete deconvolution\nis nonnegative matrix factorization (NMF), which also has a wide-range of\napplications in the machine learning community. However, the NMF is a\nwell-known strongly ill-posed problem, so a direct application of NMF to RNAseq\ndata will suffer severe difficulties in the interpretability of solutions. In\nthis paper we develop an NMF-based mathematical model and corresponding\ncomputational algorithms to improve the solution identifiability of\ndeconvoluting bulk RNAseq data. In our approach, we combine the biological\nconcept of marker genes with the solvability conditions of the NMF theories,\nand develop a geometric structured guided optimization model. In this strategy,\nthe geometric structure of bulk tissue data is first explored by the spectral\nclustering technique. Then, the identified information of marker genes is\nintegrated as solvability constraints, while the overall correlation graph is\nused as manifold regularization. Both synthetic and biological data are used to\nvalidate the proposed model and algorithms, from which solution\ninterpretability and accuracy are significantly improved.",
      "link": "http://arxiv.org/abs/2202.08733v1",
      "published": "2022-02-17T16:15:31Z",
      "updated": "2022-02-17T16:15:31Z"
    },
    {
      "title": "Client applications and Server Side docker for management of RNASeq\n  and/or VariantSeq workflows and pipelines of the GPRO Suite",
      "authors": [
        "Ahmed Hafez",
        "Beatriz Soriano",
        "Aya A. Elsayed",
        "Ricardo Futami",
        "Raquel Ceprian",
        "Ricardo Ramos-Ruiz",
        "Genis Martinez",
        "Francisco J. Roig",
        "Miguel A. Torres-Font",
        "Fernando Naya-Català",
        "Josep Alvar Calduch-Giner",
        "Lucia Trilla-Fuertes",
        "Angelo Gamez-Pozo",
        "Vicente Arnau",
        "Jose M. Sempere",
        "Jaume Perez-Sánchez",
        "Toni Gabaldón",
        "Carlos Llorens"
      ],
      "summary": "The GPRO suite is an in-progress bioinformatic project for -omic data\nanalyses. As part of the continued growth of this project, we introduce a\nclient side & server side solution for comparative transcriptomics and analysis\nof variants. The client side consists of two Java applications called \"RNASeq\"\nand \"VariantSeq\" to manage workflows for RNA-seq and Variant-seq analysis,\nrespectively, based on the most common command line interface tools for each\ntopic. Both applications are coupled with a Linux server infrastructure (named\nGPRO Server Side) that hosts all dependencies of each application (scripts,\ndatabases, and command line interface tools). Implementation of the server side\nrequires a Linux operating system, PHP, SQL, Python, bash scripting, and\nthird-party software. The GPRO Server Side can be deployed via a Docker\ncontainer that can be installed in the user's PC using any operating system or\non remote servers as a cloud solution. The two applications are available as\ndesktop and cloud applications and provide two execution modes: a Step-by-Step\nmode enables each step of a workflow to be executed independently and a\nPipeline mode allows all steps to be run sequentially. The two applications\nalso feature an experimental support system called GENIE that consists of a\nvirtual chatbot/assistant and a pipeline jobs panel coupled with an expert\nsystem. The chatbot can troubleshoot issues with the usage of each tool, the\npipeline job panel provides information about the status of each task executed\nin the GPRO Server Side, and the expert provides the user with a potential\nrecommendation to identify or fix failed analyses. The two applications and the\nGPRO Server Side combine the user-friendliness and security of client software\nwith the efficiency of front-end & back-end solutions to manage command line\ninterface software for RNA-seq and variant-seq analysis via interface\nenvironments.",
      "link": "http://arxiv.org/abs/2202.07473v4",
      "published": "2022-02-14T12:00:35Z",
      "updated": "2022-11-19T12:29:58Z"
    },
    {
      "title": "Rank-based Bayesian variable selection for genome-wide transcriptomic\n  analyses",
      "authors": [
        "Emilie Eliseussen",
        "Thomas Fleischer",
        "Valeria Vitelli"
      ],
      "summary": "Variable selection is crucial in high-dimensional omics-based analyses, since\nit is biologically reasonable to assume only a subset of non-noisy features\ncontributes to the data structures. However, the task is particularly hard in\nan unsupervised setting, and a priori ad hoc variable selection is still a very\nfrequent approach, despite the evident drawbacks and lack of reproducibility.\nWe propose a Bayesian variable selection approach for rank-based unsupervised\ntranscriptomic analysis. Making use of data rankings instead of the actual\ncontinuous measurements increases the robustness of conclusions when compared\nto classical statistical methods, and embedding variable selection into the\ninferential tasks allows complete reproducibility. Specifically, we develop a\nnovel extension of the Bayesian Mallows model for variable selection that\nallows for a full probabilistic analysis, leading to coherent quantification of\nuncertainties. Simulation studies demonstrate the versatility and robustness of\nthe proposed method in a variety of scenarios, as well as its superiority with\nrespect to several competitors when varying the data dimension or data\ngenerating process. We use the novel approach to analyse genome-wide RNAseq\ngene expression data from ovarian cancer patients: several genes that affect\ncancer development are correctly detected in a completely unsupervised fashion,\nshowing the usefulness of the method in the context of signature discovery for\ncancer genomics. Moreover, the possibility to also perform uncertainty\nquantification plays a key role in the subsequent biological investigation.",
      "link": "http://arxiv.org/abs/2107.05072v2",
      "published": "2021-07-11T15:33:18Z",
      "updated": "2022-03-20T09:46:58Z"
    },
    {
      "title": "Semi-supervised empirical Bayes group-regularized factor regression",
      "authors": [
        "Magnus M. Münch",
        "Mark A. van de Wiel",
        "Aad W. van der Vaart",
        "Carel F. W. Peeters"
      ],
      "summary": "The features in high dimensional biomedical prediction problems are often\nwell described with lower dimensional manifolds. An example is genes that are\norganised in smaller functional networks. The outcome can then be described\nwith the factor regression model. A benefit of the factor model is that is\nallows for straightforward inclusion of unlabeled observations in the\nestimation of the model, i.e., semi-supervised learning. In addition, the high\ndimensional features in biomedical prediction problems are often well\ncharacterised. Examples are genes, for which annotation is available, and\nmetabolites with $p$-values from a previous study available. In this paper, the\nextra information on the features is included in the prior model for the\nfeatures. The extra information is weighted and included in the estimation\nthrough empirical Bayes, with Variational approximations to speed up the\ncomputation. The method is demonstrated in simulations and two applications.\nOne application considers influenza vaccine efficacy prediction based on\nmicroarray data. The second application predictions oral cancer metastatsis\nfrom RNAseq data.",
      "link": "http://arxiv.org/abs/2104.02419v1",
      "published": "2021-04-06T10:52:01Z",
      "updated": "2021-04-06T10:52:01Z"
    },
    {
      "title": "A Graph Feature Auto-Encoder for the Prediction of Unobserved Node\n  Features on Biological Networks",
      "authors": [
        "Ramin Hasibi",
        "Tom Michoel"
      ],
      "summary": "Motivation: Molecular interaction networks summarize complex biological\nprocesses as graphs, whose structure is informative of biological function at\nmultiple scales. Simultaneously, omics technologies measure the variation or\nactivity of genes, proteins, or metabolites across individuals or experimental\nconditions. Integrating the complementary viewpoints of biological networks and\nomics data is an important task in bioinformatics, but existing methods treat\nnetworks as discrete structures, which are intrinsically difficult to integrate\nwith continuous node features or activity measures. Graph neural networks map\ngraph nodes into a low-dimensional vector space representation, and can be\ntrained to preserve both the local graph structure and the similarity between\nnode features.\n  Results: We studied the representation of transcriptional, protein-protein\nand genetic interaction networks in E. Coli and mouse using graph neural\nnetworks. We found that such representations explain a large proportion of\nvariation in gene expression data, and that using gene expression data as node\nfeatures improves the reconstruction of the graph from the embedding. We\nfurther proposed a new end-to-end graph feature auto-encoder which is trained\non the feature reconstruction task, and showed that it performs better at\npredicting unobserved node features than auto-encoders that are trained on the\ngraph reconstruction task before learning to predict node features. When\napplied to the problem of imputing missing data in single-cell RNAseq data, our\ngraph feature auto-encoder outperformed a state-of-the-art imputation method\nthat does not use protein interaction information, showing the benefit of\nintegrating biological networks and omics data using graph representation\nlearning.",
      "link": "http://arxiv.org/abs/2005.03961v2",
      "published": "2020-05-08T11:23:04Z",
      "updated": "2020-12-23T09:18:25Z"
    },
    {
      "title": "Transcriptional profiling reveals fundamental differences in iPS-derived\n  progenitors of endothelial cells (PECs) versus adult circulating EPCs",
      "authors": [
        "Elmira Jalilian",
        "William Raimes"
      ],
      "summary": "There are a number of different stem cell sources that have the potential to\nbe used as therapeutics in vascular degenerative diseases. On the one hand,\nthere are so called endothelial progenitor cells (EPCs), which are typically\nderived from adult blood. They carry the marker CD34, but the true nature and\ndefinition of EPCs is still controversial. On the other hand, there are\nembryonic precursors of endothelial cells (PECs), which also express CD34, and\ncan be differentiated from embryonic stem cells (ESCs) or induced pluripotent\nstem cells (iPSCs) in vitro. In this study, it was aimed to compare these two\ndifferent CD34 positive cell populations by full genome transcriptional\nprofiling (RNAseq). To this end, we firstly optimised a PEC differentiation\nprotocol and found that vascular endothelial growth factor (VEGF) is critical\nfor the transition of cells from mesodermal precursors to PECs. Additionally,\nprincipal component analysis (PCA) of RNAseq data showed that blood-derived\nEPCs clustered far from iPS-derived PECs which illustrates these populations\nare fundamentally different. This data will be useful to better define these\ncell populations and facilitating the translation of regenerative approaches in\nthis field as well as providing potentially novel diagnostic tools.",
      "link": "http://arxiv.org/abs/2005.01491v1",
      "published": "2020-05-04T13:47:25Z",
      "updated": "2020-05-04T13:47:25Z"
    },
    {
      "title": "Primary and secondary anti-viral response captured by the dynamics and\n  phenotype of individual T cell clones",
      "authors": [
        "Anastasia A. Minervina",
        "Mikhail V. Pogorelyy",
        "Ekaterina A. Komech",
        "Vadim K. Karnaukhov",
        "Petra Bacher",
        "Elisa Rosati",
        "Andre Franke",
        "Dmitriy M. Chudakov",
        "Ilgar Z. Mamedov",
        "Yuri B. Lebedev",
        "Thierry Mora",
        "Aleksandra M. Walczak"
      ],
      "summary": "The diverse repertoire of T-cell receptors (TCR) plays a key role in the\nadaptive immune response to infections. Previous studies show that secondary\nresponses to the yellow fever vaccine - the model for acute infection in humans\n- are weaker than primary ones, but only quantitative measurements can describe\nthe concentration changes and lineage fates for distinct T-cell clones in vivo\nover time. Using TCR alpha and beta repertoire sequencing for T-cell subsets,\nas well as single-cell RNAseq and TCRseq, we track the concentrations and\nphenotypes of individual T-cell clones in response to primary and secondary\nyellow fever immunization showing their large diversity. We confirm the\nsecondary response is an order of magnitude weaker, albeit $\\sim10$ days faster\nthan the primary one. Estimating the fraction of the T-cell response directed\nagainst the single immunodominant epitope, we identify the sequence features of\nTCRs that define the high precursor frequency of the two major TCR motifs\nspecific for this particular epitope. We also show the consistency of clonal\nexpansion dynamics between bulk alpha and beta repertoires, using a new\nmethodology to reconstruct alpha-beta pairings from clonal trajectories.",
      "link": "http://arxiv.org/abs/1910.11928v2",
      "published": "2019-10-25T20:44:15Z",
      "updated": "2020-03-03T08:55:17Z"
    },
    {
      "title": "Noncoding RNAs serve as the deadliest regulators for cancer",
      "authors": [
        "Anyou Wang",
        "Hai Rong"
      ],
      "summary": "Cancer is one of the leading causes of human death. Many efforts have made to\nunderstand its mechanism and have further identified many proteins and DNA\nsequence variations as suspected targets for therapy. However, drugs targeting\nthese targets have low success rates, suggesting the basic mechanism still\nremains unclear. Here, we develop a computational software combining Cox\nproportional-hazards model and stability-selection to unearth an overlooked,\nyet the most important cancer drivers hidden in massive data from The Cancer\nGenome Atlas (TCGA), including 11,574 RNAseq samples and clinic data.\nGenerally, noncoding RNAs primarily regulate cancer deaths and work as the\ndeadliest cancer inducers and repressors, in contrast to proteins as\nconventionally thought. Especially, processed-pseudogenes serve as the primary\ncancer inducers, while lincRNA and antisense RNAs dominate the repressors.\nStrikingly, noncoding RNAs serves as the universal strongest regulators for all\ncancer types although personal clinic variables such as alcohol and smoking\nsignificantly alter cancer genome. Furthermore, noncoding RNAs also work as\ncentral hubs in cancer regulatory network and as biomarkers to discriminate\ncancer types. Therefore, noncoding RNAs overall serve as the deadliest cancer\nregulators, which refreshes the basic concept of cancer mechanism and builds a\nnovel basis for cancer research and therapy. Biological functions of\npseudogenes have rarely been recognized. Here we reveal them as the most\nimportant cancer drivers for all cancer types from big data, breaking a wall to\nexplore their biological potentials.",
      "link": "http://arxiv.org/abs/1910.03934v1",
      "published": "2019-10-08T05:42:36Z",
      "updated": "2019-10-08T05:42:36Z"
    },
    {
      "title": "A data-driven method for quantifying the impact of a genetic circuit on\n  its host",
      "authors": [
        "Aqib Hasnain",
        "Subhrajit Sinha",
        "Yuval Dorfan",
        "Amin Espah Borujeni",
        "Yongjin Park",
        "Paul Maschhoff",
        "Uma Saxena",
        "Joshua Urrutia",
        "Niall Gaffney",
        "Diveena Becker",
        "Atsede Siba",
        "Narendra Maheshri",
        "Ben Gordon",
        "Chris Voigt",
        "Enoch Yeung"
      ],
      "summary": "Genetic circuits are designed to implement certain logic in living cells,\nkeeping burden on the host cell minimal. However, manipulating the genome often\nwill have a significant impact for various reasons (usage of the cell machinery\nto express new genes, toxicity of genes, interactions with native genes, etc.).\nIn this work we utilize Koopman operator theory to construct data-driven models\nof transcriptomic-level dynamics from noisy and temporally sparse RNAseq\nmeasurements. We show how Koopman models can be used to quantify impact on\ngenetic circuits. We consider an experimental example, using high-throughput\nRNAseq measurements collected from wild-type E. coli, single gate components\ntransformed in E. coli, and a NAND circuit composed from individual gates in E.\ncoli, to explore how Koopman subspace functions encode increasing circuit\ninterference on E. coli chassis dynamics. The algorithm provides a novel method\nfor quantifying the impact of synthetic biological circuits on host-chassis\ndynamics.",
      "link": "http://arxiv.org/abs/1909.06455v1",
      "published": "2019-09-13T21:19:41Z",
      "updated": "2019-09-13T21:19:41Z"
    },
    {
      "title": "Fusing heterogeneous data sets",
      "authors": [
        "Yipeng Song"
      ],
      "summary": "In systems biology, it is common to measure biochemical entities at different\nlevels of the same biological system. One of the central problems for the data\nfusion of such data sets is the heterogeneity of the data. This thesis\ndiscusses two types of heterogeneity. The first one is the type of data, such\nas metabolomics, proteomics and RNAseq data in genomics. These different omics\ndata reflect the properties of the studied biological system from different\nperspectives. The second one is the type of scale, which indicates the\nmeasurements obtained at different scales, such as binary, ordinal, interval\nand ratio-scaled variables. In this thesis, we developed several statistical\nmethods capable to fuse data sets of these two types of heterogeneity. The\nadvantages of the proposed methods in comparison with other approaches are\nassessed using comprehensive simulations as well as the analysis of real\nbiological data sets.",
      "link": "http://arxiv.org/abs/1908.09653v1",
      "published": "2019-08-23T12:20:04Z",
      "updated": "2019-08-23T12:20:04Z"
    }
  ]
}